Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.1.68/edc/PIC32MK0512MCJ048.PIC
      <edc:SFRDef edc:_addr="0x1F82A660" edc:_begin="0xa0" edc:_end="0x1a0" edc:_modsrc="DOS-01477_pwm_mc_upb_v1.Module" edc:_refcount="7" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="STRIG6" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000000000" edc:name="STRIG6" edc:nzwidth="32" edc:por="----------------0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="STRGCMP" edc:mask="0xffff" edc:name="STRGCMP" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F82A670" edc:_begin="0xa0" edc:_end="0x1a0" edc:_modsrc="DOS-01477_pwm_mc_upb_v1.Module" edc:_refcount="7" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="CAP6" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000000000" edc:name="CAP6" edc:nzwidth="32" edc:por="----------------0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CAP" edc:mask="0xffff" edc:name="CAP" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F82A680" edc:_begin="0xa0" edc:_end="0x1a0" edc:_modsrc="DOS-01477_pwm_mc_upb_v1.Module" edc:_refcount="7" edc:access="----------------nnnnnn----------" edc:cname="LEBCON6" edc:desc="" edc:impl="0xfc00" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------000000----------" edc:name="LEBCON6" edc:nzwidth="32" edc:por="----------------000000----------" edc:portals="CLR SET INV" ltx:memberofperipheral="">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="0xa"/>
            <edc:SFRFieldDef edc:cname="CLLEBEN" edc:mask="0x1" edc:name="CLLEBEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FLTLEBEN" edc:mask="0x1" edc:name="FLTLEBEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PLF" edc:mask="0x1" edc:name="PLF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PLR" edc:mask="0x1" edc:name="PLR" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PHF" edc:mask="0x1" edc:name="PHF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PHR" edc:mask="0x1" edc:name="PHR" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F82A690" edc:_begin="0xa0" edc:_end="0x1a0" edc:_modsrc="DOS-01477_pwm_mc_upb_v1.Module" edc:_refcount="7" edc:access="--------------------nnnnnnnnnnnn" edc:cname="LEBDLY6" edc:desc="" edc:impl="0xfff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------------000000000000" edc:name="LEBDLY6" edc:nzwidth="32" edc:por="--------------------000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="LEB" edc:mask="0xfff" edc:name="LEB" edc:nzwidth="0xc"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F82A6A0" edc:_begin="0xa0" edc:_end="0x1a0" edc:_modsrc="DOS-01477_pwm_mc_upb_v1.Module" edc:_refcount="7" edc:access="--------------------------nnnnnn" edc:cname="AUXCON6" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------------------000000" edc:name="AUXCON6" edc:nzwidth="32" edc:por="--------------------------000000" edc:portals="CLR SET INV" ltx:memberofperipheral="">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CHOPLEN" edc:mask="0x1" edc:name="CHOPLEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHOPHEN" edc:mask="0x1" edc:name="CHOPHEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHOPSEL" edc:mask="0xf" edc:name="CHOPSEL" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F82A6B0" edc:_begin="0xa0" edc:_end="0x1a0" edc:_modsrc="DOS-01477_pwm_mc_upb_v1.Module" edc:_refcount="7" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="PTMR6" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000000000" edc:name="PTMR6" edc:nzwidth="32" edc:por="----------------0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TMR" edc:mask="0xffff" edc:name="TMR" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F82A6C0" edc:offset="0xB40"/>
      <edc:SFRDef edc:_addr="0x1F82B200" edc:_begin="0x0" edc:_end="0xd0" edc:_modsrc="DOS-01494_qei_32b_upb_v1.Module" edc:_refcount="1" edc:access="----------------n-nnnnnn-nnnn-nn" edc:cname="QEI1CON" edc:desc="" edc:impl="0xbf7b" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0-000000-0000-00" edc:name="QEI1CON" edc:nzwidth="32" edc:por="----------------0-000000-0000-00" edc:portals="CLR SET INV">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CCM" edc:mask="0x3" edc:name="CCM" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="GATEN" edc:desc="" edc:mask="0x1" edc:name="GATEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CNTPOL" edc:desc="" edc:mask="0x1" edc:name="CNTPOL" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="INTDIV" edc:desc="" edc:mask="0x7" edc:name="INTDIV" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="IMV" edc:desc="" edc:mask="0x3" edc:name="IMV" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="PIMOD" edc:desc="" edc:mask="0x7" edc:name="PIMOD" edc:nzwidth="3"/>
            <edc:SFRFieldDef edc:cname="QEISIDL" edc:desc="" edc:mask="0x1" edc:name="QEISIDL" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="QEIEN" edc:desc="" edc:mask="0x1" edc:name="QEIEN" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
