Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.1.68/edc/PIC32MK0512MCJ048.PIC
      <edc:SFRDef edc:_addr="0x1F8604B0" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="5" edc:access="----------------nnnn--nn------nn" edc:cname="CNFE" edc:desc="" edc:impl="0xf303" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000--00------00" edc:name="CNFE" edc:nzwidth="32" edc:por="----------------0000--00------00" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTE">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNFE0" edc:mask="0x1" edc:name="CNFE0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFE1" edc:mask="0x1" edc:name="CNFE1" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNFE8" edc:mask="0x1" edc:name="CNFE8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFE9" edc:mask="0x1" edc:name="CNFE9" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNFE12" edc:mask="0x1" edc:name="CNFE12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFE13" edc:mask="0x1" edc:name="CNFE13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFE14" edc:mask="0x1" edc:name="CNFE14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFE15" edc:mask="0x1" edc:name="CNFE15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8604C0" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="5" edc:access="----------------nnnn------------" edc:cname="SRCON0E" edc:desc="" edc:impl="0xf000" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000------------" edc:name="SRCON0E" edc:nzwidth="32" edc:por="----------------0000------------" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTE">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SR0E12" edc:mask="0x1" edc:name="SR0E12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR0E13" edc:mask="0x1" edc:name="SR0E13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR0E14" edc:mask="0x1" edc:name="SR0E14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR0E15" edc:mask="0x1" edc:name="SR0E15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8604D0" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="5" edc:access="----------------nnnn------------" edc:cname="SRCON1E" edc:desc="" edc:impl="0xf000" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000------------" edc:name="SRCON1E" edc:nzwidth="32" edc:por="----------------0000------------" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTE">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SR1E12" edc:mask="0x1" edc:name="SR1E12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR1E13" edc:mask="0x1" edc:name="SR1E13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR1E14" edc:mask="0x1" edc:name="SR1E14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR1E15" edc:mask="0x1" edc:name="SR1E15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F8604E0" edc:offset="0x20"/>
      <edc:SFRDef edc:_addr="0x1F860500" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="6" edc:access="------------------nn-nn---n-----" edc:cname="ANSELF" edc:desc="" edc:grp="PORTF" edc:impl="0xffff3620" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------------11-11---1-----" edc:name="ANSELF" edc:nzwidth="0x20" edc:por="------------------11-11---1-----" edc:portals="CLR SET INV">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ANSF5" edc:desc="" edc:mask="0x1" edc:name="ANSF5" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ANSF9" edc:desc="" edc:mask="0x1" edc:name="ANSF9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANSF10" edc:desc="" edc:mask="0x1" edc:name="ANSF10" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ANSF12" edc:desc="" edc:mask="0x1" edc:name="ANSF12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANSF13" edc:desc="" edc:mask="0x1" edc:name="ANSF13" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x0" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F860510" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="6" edc:access="------------------nn-nn-nnn---nn" edc:cname="TRISF" edc:desc="" edc:grp="PORTF" edc:impl="0xffff36e3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------------11-11-111---11" edc:name="TRISF" edc:nzwidth="0x20" edc:por="------------------11-11-111---11" edc:portals="CLR SET INV">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TRISF0" edc:desc="" edc:mask="0x1" edc:name="TRISF0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISF1" edc:desc="" edc:mask="0x1" edc:name="TRISF1" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="TRISF5" edc:desc="" edc:mask="0x1" edc:name="TRISF5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISF6" edc:desc="" edc:mask="0x1" edc:name="TRISF6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISF7" edc:desc="" edc:mask="0x1" edc:name="TRISF7" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="TRISF9" edc:desc="" edc:mask="0x1" edc:name="TRISF9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISF10" edc:desc="" edc:mask="0x1" edc:name="TRISF10" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="TRISF12" edc:desc="" edc:mask="0x1" edc:name="TRISF12" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="TRISF13" edc:desc="" edc:mask="0x1" edc:name="TRISF13" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F860520" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="6" edc:access="------------------nn-nn-nnn---nn" edc:cname="PORTF" edc:desc="" edc:grp="PORTF" edc:impl="0xffff36e3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------------xx-xx-xxx---xx" edc:name="PORTF" edc:nzwidth="0x20" edc:por="------------------xx-xx-xxx---xx" edc:portals="CLR SET INV" ltx:baseofperipheral="PORTF">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RF0" edc:desc="" edc:mask="0x1" edc:name="RF0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RF1" edc:desc="" edc:mask="0x1" edc:name="RF1" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="RF5" edc:desc="" edc:mask="0x1" edc:name="RF5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RF6" edc:desc="" edc:mask="0x1" edc:name="RF6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RF7" edc:desc="" edc:mask="0x1" edc:name="RF7" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="RF9" edc:desc="" edc:mask="0x1" edc:name="RF9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RF10" edc:desc="" edc:mask="0x1" edc:name="RF10" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="RF12" edc:desc="" edc:mask="0x1" edc:name="RF12" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="RF13" edc:desc="" edc:mask="0x1" edc:name="RF13" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F860530" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="6" edc:access="------------------nn-nn-nnn---nn" edc:cname="LATF" edc:desc="" edc:grp="PORTF" edc:impl="0xffff36e3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------------xx-xx-xxx---xx" edc:name="LATF" edc:nzwidth="0x20" edc:por="------------------xx-xx-xxx---xx" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTF">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="LATF0" edc:desc="" edc:mask="0x1" edc:name="LATF0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATF1" edc:desc="" edc:mask="0x1" edc:name="LATF1" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="LATF5" edc:desc="" edc:mask="0x1" edc:name="LATF5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATF6" edc:desc="" edc:mask="0x1" edc:name="LATF6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATF7" edc:desc="" edc:mask="0x1" edc:name="LATF7" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="LATF9" edc:desc="" edc:mask="0x1" edc:name="LATF9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATF10" edc:desc="" edc:mask="0x1" edc:name="LATF10" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="LATF12" edc:desc="" edc:mask="0x1" edc:name="LATF12" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="LATF13" edc:desc="" edc:mask="0x1" edc:name="LATF13" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F860540" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="6" edc:access="------------------nn-nn-nnn---nn" edc:cname="ODCF" edc:desc="" edc:grp="PORTF" edc:impl="0xffff36e3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------------00-00-000---00" edc:name="ODCF" edc:nzwidth="0x20" edc:por="------------------00-00-000---00" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTF">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ODCF0" edc:desc="" edc:mask="0x1" edc:name="ODCF0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCF1" edc:desc="" edc:mask="0x1" edc:name="ODCF1" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ODCF5" edc:desc="" edc:mask="0x1" edc:name="ODCF5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCF6" edc:desc="" edc:mask="0x1" edc:name="ODCF6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCF7" edc:desc="" edc:mask="0x1" edc:name="ODCF7" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ODCF9" edc:desc="" edc:mask="0x1" edc:name="ODCF9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCF10" edc:desc="" edc:mask="0x1" edc:name="ODCF10" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ODCF12" edc:desc="" edc:mask="0x1" edc:name="ODCF12" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ODCF13" edc:desc="" edc:mask="0x1" edc:name="ODCF13" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F860550" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="6" edc:access="------------------nn-nn-nnn---nn" edc:cname="CNPUF" edc:desc="" edc:grp="PORTF" edc:impl="0xffff36e3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------------00-00-000---00" edc:name="CNPUF" edc:nzwidth="0x20" edc:por="------------------00-00-000---00" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTF">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNPUF0" edc:desc="" edc:mask="0x1" edc:name="CNPUF0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUF1" edc:desc="" edc:mask="0x1" edc:name="CNPUF1" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNPUF5" edc:desc="" edc:mask="0x1" edc:name="CNPUF5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUF6" edc:desc="" edc:mask="0x1" edc:name="CNPUF6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUF7" edc:desc="" edc:mask="0x1" edc:name="CNPUF7" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNPUF9" edc:desc="" edc:mask="0x1" edc:name="CNPUF9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUF10" edc:desc="" edc:mask="0x1" edc:name="CNPUF10" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNPUF12" edc:desc="" edc:mask="0x1" edc:name="CNPUF12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUF13" edc:desc="" edc:mask="0x1" edc:name="CNPUF13" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F860560" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="6" edc:access="------------------nn-nn-nnn---nn" edc:cname="CNPDF" edc:desc="" edc:grp="PORTF" edc:impl="0xffff36e3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------------00-00-000---00" edc:name="CNPDF" edc:nzwidth="0x20" edc:por="------------------00-00-000---00" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTF">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNPDF0" edc:desc="" edc:mask="0x1" edc:name="CNPDF0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDF1" edc:desc="" edc:mask="0x1" edc:name="CNPDF1" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNPDF5" edc:desc="" edc:mask="0x1" edc:name="CNPDF5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDF6" edc:desc="" edc:mask="0x1" edc:name="CNPDF6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDF7" edc:desc="" edc:mask="0x1" edc:name="CNPDF7" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNPDF9" edc:desc="" edc:mask="0x1" edc:name="CNPDF9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDF10" edc:desc="" edc:mask="0x1" edc:name="CNPDF10" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNPDF12" edc:desc="" edc:mask="0x1" edc:name="CNPDF12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDF13" edc:desc="" edc:mask="0x1" edc:name="CNPDF13" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F860570" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="6" edc:access="----------------n---n-----------" edc:cname="CNCONF" edc:desc="" edc:grp="PORTF" edc:impl="0xffff9fff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0---0-----------" edc:name="CNCONF" edc:nzwidth="0x20" edc:por="----------------0---0-----------" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTF">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="0xb"/>
            <edc:SFRFieldDef edc:cname="EDGEDETECT" edc:mask="0x1" edc:name="EDGEDETECT" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:FreezeBit edc:freezeval="1" edc:name="CHANGE NOTICE F" edc:pos="14"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F860580" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="6" edc:access="------------------nn-nn-nnn---nn" edc:cname="CNENF" edc:desc="" edc:grp="PORTF" edc:impl="0xffc036e3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------------00-00-000---00" edc:name="CNENF" edc:nzwidth="0x20" edc:por="------------------00-00-000---00" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTF">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNIEF0" edc:desc="" edc:mask="0x1" edc:name="CNIEF0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEF1" edc:desc="" edc:mask="0x1" edc:name="CNIEF1" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNIEF5" edc:desc="" edc:mask="0x1" edc:name="CNIEF5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEF6" edc:desc="" edc:mask="0x1" edc:name="CNIEF6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEF7" edc:desc="" edc:mask="0x1" edc:name="CNIEF7" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNIEF9" edc:desc="" edc:mask="0x1" edc:name="CNIEF9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEF10" edc:desc="" edc:mask="0x1" edc:name="CNIEF10" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNIEF12" edc:desc="" edc:mask="0x1" edc:name="CNIEF12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEF13" edc:desc="" edc:mask="0x1" edc:name="CNIEF13" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
